STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-DK/stm32mp257f_disco_usbpd_pwr.c
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_LOW;

  gpio_init_structure.Pin = USBPD_PWR_VCONN_CC1_EN_GPIO_PIN;
  HAL_GPIO_Init(USBPD_PWR_VCONN_CC1_EN_GPIO_PORT, &gpio_init_structure);

  if (!USBPD_PWR_VCONN_CC2_EN_GPIO_IS_CLK_ENABLE())
  {
    /* Enable TCPP_EN */
    if (ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(92)) == RESMGR_STATUS_ACCESS_OK)
    {
      USBPD_PWR_VCONN_CC2_EN_GPIO_CLK_ENABLE();
    }
  }
  if (ResMgr_Request(USBPD_PWR_VCONN_CC2_EN_RIF_RES_TYP_GPIO, USBPD_PWR_VCONN_CC2_EN_RIF_RES_NUM_GPIO) !=
      RESMGR_STATUS_ACCESS_OK)
  {
    while (1) {};
  }

  gpio_init_structure.Pin = USBPD_PWR_VCONN_CC2_EN_GPIO_PIN;
  HAL_GPIO_Init(USBPD_PWR_VCONN_CC2_EN_GPIO_PORT, &gpio_init_structure);

  return 0;
}

/**
  * @brief  DeConfigure VCONN CC1 and CC2 GPIOs.
  * @note   VCONN_CC1_EN and VCONN_CC2_EN GPIO pin
  * @retval None
  */
static int32_t PWR_VCONN_CC12_GPIO_DeInit(void)
{

  /* DeConfigure VCONN_CC1 */
  HAL_GPIO_DeInit(USBPD_PWR_VCONN_CC1_EN_GPIO_PORT, USBPD_PWR_VCONN_CC1_EN_GPIO_PIN);
  ResMgr_Release(USBPD_PWR_VCONN_CC1_EN_RIF_RES_TYP_GPIO, USBPD_PWR_VCONN_CC1_EN_RIF_RES_NUM_GPIO);

  /* DeConfigure VCONN_CC2 */
  HAL_GPIO_DeInit(USBPD_PWR_VCONN_CC2_EN_GPIO_PORT, USBPD_PWR_VCONN_CC2_EN_GPIO_PIN);
  ResMgr_Release(USBPD_PWR_VCONN_CC2_EN_RIF_RES_TYP_GPIO, USBPD_PWR_VCONN_CC2_EN_RIF_RES_NUM_GPIO);

  return 0;
}

static int32_t PWR_SetVConnSwitch(TCPP0203_Object_t *pObj, uint8_t VConnSwitch)
{
  UNUSED(pObj);

  if (VConnSwitch == TCPP0203_VCONN_SWITCH_OPEN)
  {
    /* Disable VCONN_CC1 */
    HAL_GPIO_WritePin(USBPD_PWR_VCONN_CC1_EN_GPIO_PORT, USBPD_PWR_VCONN_CC1_EN_GPIO_PIN, GPIO_PIN_RESET);
    BSP_USBPD_PWR_TRACE(0, ">>>>>>>>> VCONN DISABLE CC1\n");
    /* Disable VCONN_CC2 */
    HAL_GPIO_WritePin(USBPD_PWR_VCONN_CC2_EN_GPIO_PORT, USBPD_PWR_VCONN_CC2_EN_GPIO_PIN, GPIO_PIN_RESET);
    BSP_USBPD_PWR_TRACE(0, ">>>>>>>>> VCONN DISABLE CC2\n");
  }
  else if (VConnSwitch == TCPP0203_VCONN_SWITCH_CC1)
  {
    /* Disable VCONN_CC2 */
    HAL_GPIO_WritePin(USBPD_PWR_VCONN_CC2_EN_GPIO_PORT, USBPD_PWR_VCONN_CC2_EN_GPIO_PIN, GPIO_PIN_RESET);
    BSP_USBPD_PWR_TRACE(0, ">>>>>>>>> VCONN DISABLE CC2\n");
    /* Enable VCONN_CC1 */
    HAL_GPIO_WritePin(USBPD_PWR_VCONN_CC1_EN_GPIO_PORT, USBPD_PWR_VCONN_CC1_EN_GPIO_PIN, GPIO_PIN_SET);
    BSP_USBPD_PWR_TRACE(0, ">>>>>>>>> VCONN ENABLE CC1\n");
  }
  else
  {
    /* Disable VCONN_CC1 */
    HAL_GPIO_WritePin(USBPD_PWR_VCONN_CC1_EN_GPIO_PORT, USBPD_PWR_VCONN_CC1_EN_GPIO_PIN, GPIO_PIN_RESET);
    BSP_USBPD_PWR_TRACE(0, ">>>>>>>>> VCONN DISABLE CC1\n");
    /* Enable VCONN_CC2 */
    HAL_GPIO_WritePin(USBPD_PWR_VCONN_CC2_EN_GPIO_PORT, USBPD_PWR_VCONN_CC2_EN_GPIO_PIN, GPIO_PIN_SET);
    BSP_USBPD_PWR_TRACE(0, ">>>>>>>>> VCONN ENABLE CC2\n");
  }

  return 0;
}

static int32_t PWR_GetVConnSwitchAck(TCPP0203_Object_t *pObj, uint8_t *pVConnSwitchAck)
{
  UNUSED(pObj);

  /* Read CC1 Output State */
  if ((USBPD_PWR_VCONN_CC1_EN_GPIO_PORT->ODR & USBPD_PWR_VCONN_CC1_EN_GPIO_PIN) != 0x00u)
  {
    *pVConnSwitchAck = TCPP0203_VCONN_SWITCH_CC1;
  }
  else
  {
    /* Read CC2 Output State */
    if ((USBPD_PWR_VCONN_CC2_EN_GPIO_PORT->ODR & USBPD_PWR_VCONN_CC2_EN_GPIO_PIN) != 0x00u)
    {
      *pVConnSwitchAck = TCPP0203_VCONN_SWITCH_CC2;
    }
    else
      *pVConnSwitchAck = TCPP0203_VCONN_SWITCH_OPEN;
  }

  return 0;
}

/**
  * @brief  Initialize VCONN sourcing.
  * @param  PortNum Type-C port identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNInit(uint32_t PortNum,
                                uint32_t CCPinId)
{
  UNUSED(CCPinId);
  int32_t ret = BSP_ERROR_NONE;

  /* Check if instance is valid */
  if (PortNum >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* No specific treatment required for initialising VCONN management from TCPP03 */
    /* Initialise VCONN management from TCPP03 :
        Ensure VCONN switch to Open/Open
        Ensure VCONN Discharge OFF
    */

    BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VCONNInit --");

    if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnSwitch(&USBPD_PWR_PortCompObj[PortNum],
                                                       TCPP0203_VCONN_SWITCH_OPEN) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum],
                                                          TCPP0203_VCONN_DISCHARGE_OFF) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  return ret;
}

/**
  * @brief  De-initialize VCONN sourcing.
  * @param  PortNum Type-C port identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNDeInit(uint32_t PortNum,
                                  uint32_t CCPinId)
{
  UNUSED(CCPinId);
  int32_t ret = BSP_ERROR_NONE;

  /* Check if instance is valid */
  if (PortNum >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* De-initialise VCONN management from TCPP03 :
        Force VCONN switch to Open/Open
        Force VCONN Discharge OFF
    */

    BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VCONNDeInit --");

    if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnSwitch(&USBPD_PWR_PortCompObj[PortNum],
                                                       TCPP0203_VCONN_SWITCH_OPEN) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum],
                                                            TCPP0203_VCONN_DISCHARGE_OFF) != TCPP0203_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  return ret;
}

/**
  * @brief  Enable VCONN sourcing.
  * @param  PortNum Type-C port identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNOn(uint32_t PortNum,
                              uint32_t CCPinId)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if parameters are valid */
  if ((PortNum >= USBPD_PWR_INSTANCES_NBR)
      || ((CCPinId != USBPD_PWR_TYPE_C_CC1) && (CCPinId != USBPD_PWR_TYPE_C_CC2))
     )
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Set TCPP0203 VCONN Switch according to CC pin used for VCONN */
    if (CCPinId == USBPD_PWR_TYPE_C_CC1)
    {
      if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnSwitch(&USBPD_PWR_PortCompObj[PortNum],
                                                         TCPP0203_VCONN_SWITCH_CC1) != TCPP0203_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
    else
    {
      if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnSwitch(&USBPD_PWR_PortCompObj[PortNum],
                                                         TCPP0203_VCONN_SWITCH_CC2) != TCPP0203_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  return ret;
}

/**
  * @brief  Disable VCONN sourcing.
  * @param  PortNum Type-C port identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  CCPinId CC pin identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNOff(uint32_t PortNum,
                               uint32_t CCPinId)
{
  UNUSED(CCPinId);
  int32_t ret = BSP_ERROR_NONE;

  /* Check if instance is valid */
  if (PortNum >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Switch off VCONN : restore VCONN switch to Open/open position */
    if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnSwitch(&USBPD_PWR_PortCompObj[PortNum],
                                                       TCPP0203_VCONN_SWITCH_OPEN) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Discharge VCONN path */
      if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum],
                                                            TCPP0203_VCONN_DISCHARGE_ON) != TCPP0203_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        /* Wait DISCHARGE is completed then disable VCONN Discharge */
        HAL_Delay(10U);
        if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum],
                                                              TCPP0203_VCONN_DISCHARGE_OFF) != TCPP0203_OK)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
      }
    }
  }
  return ret;
}

/**
  * @brief  Get actual VCONN status.
  * @param  PortNum Type-C port identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_CC1
  *         @arg @ref USBPD_PWR_TYPE_C_CC2
  * @param  pState VCONN status (1: On, 0: Off)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNIsOn(uint32_t PortNum,
                                uint32_t CCPinId, uint8_t *pState)
{
  int32_t ret = BSP_ERROR_NONE;
  uint8_t vconnSwitch;

  *pState = 0U;

  /* Check if parameters are valid */
  if ((PortNum >= USBPD_PWR_INSTANCES_NBR) || (NULL == pState)
      || ((CCPinId != USBPD_PWR_TYPE_C_CC1) && (CCPinId != USBPD_PWR_TYPE_C_CC2))
     )
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Get TCPP0203 VCONN Switch position */
    if (USBPD_PWR_PortCompDrv[PortNum]->GetVConnSwitchAck(&USBPD_PWR_PortCompObj[PortNum],
                                                          &vconnSwitch) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      if (((CCPinId == USBPD_PWR_TYPE_C_CC1) && (vconnSwitch == TCPP0203_VCONN_SWITCH_CC1))
          || ((CCPinId == USBPD_PWR_TYPE_C_CC2) && (vconnSwitch == TCPP0203_VCONN_SWITCH_CC2))
         )
      {
        *pState = 1U;
      }
    }
  }
  return ret;
}

/**
  * @brief  Activate discharge on VCONN.
  * @param  PortNum Type-C port identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNDischargeOn(uint32_t PortNum)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if instance is valid */
  if (PortNum >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VCONNDischargeOn --");

