STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-DK/stm32mp257f_disco_usbpd_pwr.c
    if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnSwitch(&USBPD_PWR_PortCompObj[PortNum],
                                                       TCPP0203_VCONN_SWITCH_OPEN) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum],
                                                            TCPP0203_VCONN_DISCHARGE_ON) != TCPP0203_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }
  }
  return ret;
}

/**
  * @brief  Deactivate discharge on VCONN.
  * @param  PortNum Type-C port identifier
  *         This parameter can take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VCONNDischargeOff(uint32_t PortNum)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if instance is valid */
  if (PortNum >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_VCONNDischargeOff --");

    if (USBPD_PWR_PortCompDrv[PortNum]->SetVConnDischarge(&USBPD_PWR_PortCompObj[PortNum],
                                                          TCPP0203_VCONN_DISCHARGE_OFF) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }
  return ret;
}

/**
  * @brief  USBPD PWR callback used to notify a asynchronous PWR event.
  *         (This callback caould be called fromp an IT routine, associated to
  *         any PWR related event detection mechanism)
  * @param  PortNum Type-C port identifier
  * @retval None
  */
void BSP_USBPD_PWR_EventCallback(uint32_t PortNum)
{
  BSP_USBPD_PWR_TRACE(PortNum, "-- BSP_USBPD_PWR_EventCallback --");

  /* Handle USBPD PWR event */
  switch (USBPD_PWR_Port_Configs[PortNum].Type)
  {
    case USBPD_PWR_HW_CONFIG_TYPE_TCPP02:
    case USBPD_PWR_HW_CONFIG_TYPE_TCPP03:
      /* In case of TCPP0203, this callback could be called when an event is detected
         on FLGn line */
      PWR_TCPP0203_EventCallback(PortNum);
      break;

    case USBPD_PWR_HW_CONFIG_TYPE_DEFAULT:
    case USBPD_PWR_HW_CONFIG_TYPE_TCPP01:
    default:
      break;
  }
}

/**
  * @}
  */

/** @addtogroup STM32MP257F_DK_USBPD_PWR_Private_Functions
  * @{
  */


/**
  * @brief  Configure TCPP0203 used GPIO.
  * @note   GPIO used for TCPP0203 operation includes VBUS measurement, ENABLE pin driving
  * @param  PortNum   Port number
  * @retval None
  */
static void PWR_TCPP0203_GPIOConfigInit(uint32_t PortNum)
{
  UNUSED(PortNum);

#if defined(USE_STM32MP257F_DK)
  GPIO_InitTypeDef gpio_init_structure;


  if (!TCPP0203_PORT0_EN_GPIO_IS_CLK_ENABLE())
  {
    /* Enable TCPP_EN */
    if (ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(90)) == RESMGR_STATUS_ACCESS_OK)
    {
      TCPP0203_PORT0_EN_GPIO_CLK_ENABLE();
    }
  }
  if (ResMgr_Request(TCPP0203_PORT0_EN_RIF_RES_TYP_GPIO, TCPP0203_PORT0_EN_GPIO_RIF_RES_NUM_GPIO) !=
      RESMGR_STATUS_ACCESS_OK)
  {
    while (1) {};
  }

  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_LOW;
  gpio_init_structure.Pin = TCPP0203_PORT0_EN_GPIO_PIN;
  HAL_GPIO_Init(TCPP0203_PORT0_EN_GPIO_PORT, &gpio_init_structure);
  HAL_GPIO_WritePin(TCPP0203_PORT0_EN_GPIO_PORT, TCPP0203_PORT0_EN_GPIO_PIN, GPIO_PIN_SET);
#endif /* USE_STM32MP257F_DK */

  if (!TCPP0203_PORT0_VBUSC_GPIO_IS_CLK_ENABLE())
  {
    if (ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(95)) == RESMGR_STATUS_ACCESS_OK)
    {
      TCPP0203_PORT0_VBUSC_GPIO_CLK_ENABLE();
    }
  }
  if (ResMgr_Request(TCPP0203_PORT0_VBUSCGPIO_RIF_RES_TYP_GPIO, TCPP0203_PORT0_VBUSC_GPIO_RIF_RES_NUM_GPIO) !=
      RESMGR_STATUS_ACCESS_OK)
  {
    while (1) {};
  }

  /* Configure GPIO in Analog mode */
  LL_GPIO_SetPinMode(TCPP0203_PORT0_VBUSC_GPIO_PORT, TCPP0203_PORT0_VBUSC_GPIO_PIN, TCPP0203_PORT0_VBUSC_GPIO_MODE);
}

/**
  * @brief  DeConfigure TCPP0203 used GPIO.
  * @note   GPIO used for TCPP0203 operation includes VBUS measurement, ENABLE pin driving
  * @param  PortNum   Port number
  * @retval None
  */
static void PWR_TCPP0203_GPIOConfigDeInit(uint32_t PortNum)
{
  UNUSED(PortNum);

#if defined(USE_STM32MP257F_DK)
  HAL_GPIO_DeInit(TCPP0203_PORT0_EN_GPIO_PORT, TCPP0203_PORT0_EN_GPIO_PIN);
  ResMgr_Release(TCPP0203_PORT0_EN_RIF_RES_TYP_GPIO, TCPP0203_PORT0_EN_GPIO_RIF_RES_NUM_GPIO);
#endif /* USE_STM32MP257F_DK */

  HAL_GPIO_DeInit(TCPP0203_PORT0_VBUSC_GPIO_PORT, TCPP0203_PORT0_VBUSC_GPIO_PIN);
  ResMgr_Release(TCPP0203_PORT0_VBUSCGPIO_RIF_RES_TYP_GPIO, TCPP0203_PORT0_VBUSC_GPIO_RIF_RES_NUM_GPIO);
}

static void MX_ADC_DeInit(void)
{
  if (hadc.Instance)
  {
    HAL_ADC_Stop(&hadc);
    HAL_ADC_DeInit(&hadc);
    (void)ResMgr_Release(RESMGR_RESOURCE_RIFSC, RESMGR_RIFSC_ADC3_ID);
  }
}

static void MX_ADC_Init(void)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /* USER CODE BEGIN ADC_Init 0 */
  if (ResMgr_Request(RESMGR_RESOURCE_RIFSC, RESMGR_RIFSC_ADC3_ID) != RESMGR_STATUS_ACCESS_OK)
  {
    while (1) {};
  }
  TCPP0203_PORT0_ADC_CLK_ENABLE();

  /* Configuration of ADC VREF Power */
  if (ResMgr_Request(RESMGR_RESOURCE_RIF_PWR, RESMGR_PWR_RESOURCE(0)) == RESMGR_STATUS_ACCESS_OK)
  {
    PWR->CR1 |= PWR_CR1_AVMEN;
    OS_DELAY(1);
    PWR->CR1 |= PWR_CR1_ASV;    /* Remove the VDDA18ADC power isolation */
    OS_DELAY(1);
    while ((PWR->CR1 & PWR_CR1_ARDY) == 0);  /* Wait for PWR ready */
  }
  if (ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(47)) == RESMGR_STATUS_ACCESS_OK)
  {
    /* Initializes the peripheral clock */
    PeriphClkInitStruct.XBAR_Channel = VSENSE_ADC_RCC_PERIPHCLK;
    PeriphClkInitStruct.XBAR_ClkSrc = RCC_XBAR_CLKSRC_PLL4;
    /* 1200MHz / 12 = 100MHz */
    PeriphClkInitStruct.Div = 12;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      while (1) {};
    }
  }

  /* Configure VBUS Connector sensing GPIO */
  if (!TCPP0203_PORT0_VBUSC_GPIO_IS_CLK_ENABLE())
  {
    if (ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(95)) == RESMGR_STATUS_ACCESS_OK)
    {
      TCPP0203_PORT0_VBUSC_GPIO_CLK_ENABLE();
    }
  }
  if (ResMgr_Request(TCPP0203_PORT0_VBUSCGPIO_RIF_RES_TYP_GPIO, TCPP0203_PORT0_VBUSC_GPIO_RIF_RES_NUM_GPIO) !=
      RESMGR_STATUS_ACCESS_OK)
  {
    while (1) {};
  }

  LL_GPIO_SetPinMode(TCPP0203_PORT0_VBUSC_GPIO_PORT, TCPP0203_PORT0_VBUSC_GPIO_PIN, TCPP0203_PORT0_VBUSC_GPIO_MODE);

