STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-DK/stm32mp257f_disco_usbpd_pwr.c
  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC_Init 1 */

  /* USER CODE END ADC_Init 1 */
  /* Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion) */
  hadc.Instance = VSENSE_ADC_INSTANCE;
  hadc.Init.ClockPrescaler = VSENSE_ADC_CLOCK_PRESCALER;
  hadc.Init.Resolution = ADC_RESOLUTION_12B;
  hadc.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  hadc.Init.LowPowerAutoWait = DISABLE;
  hadc.Init.ContinuousConvMode = ENABLE;
  hadc.Init.NbrOfConversion = 1;
  hadc.Init.DiscontinuousConvMode = DISABLE;
  hadc.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
  hadc.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
  hadc.Init.OversamplingMode = DISABLE;
  if (HAL_ADC_Init(&hadc) != HAL_OK)
  {
  }

  /* Configure Regular Channel */
  sConfig.Channel = VSENSE_ADC_CHANNEL;
  sConfig.Rank = VSENSE_ADC_RANK;
  sConfig.SamplingTime = ADC_SAMPLETIME_247CYCLES_5;
  sConfig.SingleDiff   = ADC_SINGLE_ENDED;            /* Single-ended input channel */
  sConfig.OffsetNumber = ADC_OFFSET_NONE;             /* No offset subtraction */
  sConfig.Offset = 0;                                 /* Parameter discarded because offset correction is disabled */
  sConfig.OffsetRightShift = DISABLE;
  sConfig.OffsetSignedSaturation = DISABLE;
  sConfig.OffsetSaturation = DISABLE;
  sConfig.OffsetSign = ADC_OFFSET_SIGN_POSITIVE;

  if (HAL_ADC_ConfigChannel(&hadc, &sConfig) != HAL_OK)
  {
  }

  /* USER CODE BEGIN ADC_Init 2 */
  if (HAL_ADCEx_Calibration_Start(&hadc, ADC_SINGLE_ENDED) != HAL_OK)
  {
  }

  if (HAL_ADC_Start(&hadc) != HAL_OK)
  {
  }
  /* USER CODE END ADC_Init 2 */
}

/**
  * @brief  Configure TCPP0203 low level interrupt.
  * @note   Corresponds to EXTI mapped onto FLGn pin of TCPP0203
  * @param  PortNum   Port number
  * @retval None
  */
static void PWR_TCPP0203_ITConfigInit(uint32_t PortNum)
{
  if (USBPD_PWR_Port_Status[PortNum].IsItEnabled == 0U)
  {
    USBPD_PWR_Port_Status[PortNum].IsItEnabled = 1U;

    /*  Configure VBUS Connector sensing GPIO */
    if (!TCPP0203_PORT0_FLG_GPIO_IS_CLK_ENABLE())
    {
      if (ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(96)) == RESMGR_STATUS_ACCESS_OK)
      {
        TCPP0203_PORT0_FLG_GPIO_CLK_ENABLE();
      }
    }
    if (ResMgr_Request(TCPP0203_PORT0_FLG_RIF_RES_TYP_GPIO, TCPP0203_PORT0_FLG_GPIO_RIF_RES_NUM_GPIO) !=
        RESMGR_STATUS_ACCESS_OK)
    {
      while (1) {};
    }

    /* Configure IO */
    LL_GPIO_SetPinMode(TCPP0203_PORT0_FLG_GPIO_PORT, TCPP0203_PORT0_FLG_GPIO_PIN, TCPP0203_PORT0_FLG_GPIO_MODE);
    LL_GPIO_SetPinPull(TCPP0203_PORT0_FLG_GPIO_PORT, TCPP0203_PORT0_FLG_GPIO_PIN, TCPP0203_PORT0_FLG_GPIO_PUPD);

    /* Connect External Line to the GPIO*/
    TCPP0203_PORT0_FLG_SET_EXTI();

    /* Enable a falling trigger EXTI line x Interrupt */
    TCPP0203_PORT0_FLG_EXTI_ENABLE();
    TCPP0203_PORT0_FLG_TRIG_ENABLE();

    /* Configure NVIC for EXTIx_IRQn */
    NVIC_SetPriority(TCPP0203_PORT0_FLG_EXTI_IRQN, TCPP0203_PORT0_FLG_IT_PRIORITY);
    NVIC_EnableIRQ(TCPP0203_PORT0_FLG_EXTI_IRQN);
  }
}

static void PWR_TCPP0203_ITConfigDeInit(uint32_t PortNum)
{
  (void)PortNum;
  TCPP0203_PORT0_FLG_EXTI_DISABLE();
  NVIC_DisableIRQ(TCPP0203_PORT0_FLG_EXTI_IRQN);
}

/**
  * @brief  I2C BUS registration for TCPP0203 communication
  * @param  PortNum   Port number
  * @param  Address   I2C Address
  * @retval BSP status
  */
static int32_t PWR_TCPP0203_BUSConfigInit(uint32_t PortNum, uint16_t Address)
{
  int32_t                  ret = BSP_ERROR_NONE;
  TCPP0203_IO_t            TCPP0203IOCtx;
  uint8_t                  tcpp_type;

  /* Configure the TCPP0203 I2C driver */
  TCPP0203IOCtx.Address     = Address;
  TCPP0203IOCtx.Init        = BSP_I2C_Init;
  TCPP0203IOCtx.DeInit      = BSP_I2C_DeInit;
  TCPP0203IOCtx.ReadReg     = BSP_I2C_ReadReg;
  TCPP0203IOCtx.WriteReg    = BSP_I2C_WriteReg;
  TCPP0203IOCtx.GetTick     = BSP_GetTick;

  /* Register the component on BUS IO */
  if (TCPP0203_RegisterBusIO(&USBPD_PWR_PortCompObj[PortNum], &TCPP0203IOCtx) != TCPP0203_OK)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }
  else
  {
    /* Initialisation step */
    USBPD_PWR_PortCompDrv[PortNum] = &TCPP0203_Driver;
    /*
     * Incase SetVConnSwitch and GetVConnSwitchAck handlers are set
     * in Port_Config, then override the TCPP handler functions
     * This is done for case when VCONN link with CCx is handled by fw
     * using external GPIOs instead of TCPP internal logic
     */
    if (USBPD_PWR_Port_Configs[PortNum].SetVConnSwitch)
    {
      TCPP0203_Driver.SetVConnSwitch = USBPD_PWR_Port_Configs[PortNum].SetVConnSwitch;
    }
    if (USBPD_PWR_Port_Configs[PortNum].GetVConnSwitchAck)
    {
      TCPP0203_Driver.GetVConnSwitchAck = USBPD_PWR_Port_Configs[PortNum].GetVConnSwitchAck;
    }
    if (USBPD_PWR_PortCompDrv[PortNum]->Init(&USBPD_PWR_PortCompObj[PortNum]) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }

    /* Read the component type */
    if (USBPD_PWR_PortCompDrv[PortNum]->ReadTCPPType(&USBPD_PWR_PortCompObj[PortNum], &tcpp_type) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    /* Check the component type */
    else if ((tcpp_type != TCPP0203_DEVICE_TYPE_02)
             && (tcpp_type != TCPP0203_DEVICE_TYPE_03))
    {
      ret = BSP_ERROR_UNKNOWN_COMPONENT;
    }
    /* Reset TCPP0203 Reg0 register */
    else if (USBPD_PWR_PortCompDrv[PortNum]->Reset(&USBPD_PWR_PortCompObj[PortNum]) != TCPP0203_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Check the component type and update config accordingly */
      USBPD_PWR_Port_Configs[PortNum].Type = tcpp_type;

      /* Update Port Config */
      if (TCPP0203_DEVICE_TYPE_02 == tcpp_type)
      {
        USBPD_PWR_Port_Configs[PortNum].Type = USBPD_PWR_HW_CONFIG_TYPE_TCPP02;
        BSP_USBPD_PWR_TRACE(PortNum, "-- TCPP02 detected");
      }
      else if (TCPP0203_DEVICE_TYPE_03 == tcpp_type)
      {
        USBPD_PWR_Port_Configs[PortNum].Type = USBPD_PWR_HW_CONFIG_TYPE_TCPP03;
        BSP_USBPD_PWR_TRACE(PortNum, "-- TCPP03 detected");
      }

      /* Registration completed */
    }
  }
  return ret;
}

/**
  * @brief  De-Initialize TCPP0203 HW resources associated to Type-C port
  * @param  PortNum   Port number
  * @retval BSP Status
  */
static int32_t PWR_TCPP0203_ConfigDeInit(uint32_t PortNum)
{
  (void)ResMgr_Release(TCPP0203_PORT0_EN_RIF_RES_TYP_GPIO, TCPP0203_PORT0_EN_GPIO_RIF_RES_NUM_GPIO);
  (void)ResMgr_Release(TCPP0203_PORT0_VBUSCGPIO_RIF_RES_TYP_GPIO, TCPP0203_PORT0_VBUSC_GPIO_RIF_RES_NUM_GPIO);
  (void)ResMgr_Release(TCPP0203_PORT0_FLG_RIF_RES_TYP_GPIO, TCPP0203_PORT0_FLG_GPIO_RIF_RES_NUM_GPIO);
  UNUSED(PortNum);
  return (BSP_ERROR_NONE);
}

/**
  * @brief  Handle Event callback
  * @param  PortNum   Port number
  * @retval None
  */
static void PWR_TCPP0203_EventCallback(uint32_t PortNum)
{
  uint8_t flg_reg;

  /* In case of TCPP0203, this callback could be called when an event is detected
     on FLGn line */
  if (USBPD_PWR_Port_Status[PortNum].IsInitialized == 1U)
  {
    /* Read Flags register (FLGn) */
    if (USBPD_PWR_PortCompDrv[PortNum]->ReadFlagRegister(&USBPD_PWR_PortCompObj[PortNum], &flg_reg) == TCPP0203_OK)
    {
#ifdef _TRACE
      char _str[13];
      (void)sprintf(_str, "Reg2_0x%02x", flg_reg);
      BSP_USBPD_PWR_TRACE(PortNum, _str);
#endif /* _TRACE */

